EDT/УТ/src/Catalogs/ВариантыТаблицыПодъемов/ВариантыТаблицыПодъемов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыТаблицыПодъемов</name>
  <predefined>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
  </predefined>
  <tabularSections>
    <name>Таблица2016</name>
    <attributes>
      <name>ТипПодъемаНаЭтаж</name>
      <type>
        <types>EnumRef.ТипПодъемаНаЭтаж</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПодъема</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ПодъёмыНаБланкахЗаказа/ПодъёмыНаБланкахЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодъёмыНаБланкахЗаказа</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВариантТаблицыПодъемов</name>
    <type>
      <types>CatalogRef.ВариантыТаблицыПодъемов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПункта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ВариантыТаблицыПодъемов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список.Параметры.УстановитьЗначениеПараметра("ВариантТаблицыПодъемов", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ФормаП = ОткрытьФорму("РегистрСведений.ПодъёмыНаБланкахЗаказа.Форма.ФормаЗаписи");//, Парам);
		ФормаП.Запись.ВариантТаблицыПодъемов = Объект.Ссылка;		
	Иначе
		От = Вопрос("Перед вводом данных необходимо записать объект. Записать?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
		Если От = КодВозвратаДиалога.Да Тогда
			Если ЗначениеЗаполнено(Объект.Наименование) Тогда 
				Записать();
				ФормаП = ОткрытьФорму("РегистрСведений.ПодъёмыНаБланкахЗаказа.Форма.ФормаЗаписи");//, Парам);
				ФормаП.Запись.ВариантТаблицыПодъемов = Объект.Ссылка;
			Иначе
				Предупреждение("Необходимо ввести наименование!", ,"Ошибка");
				Отказ = Истина;	
			КонецЕсли;
		Иначе
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;
	//ФормаП = ОткрытьФорму("РегистрСведений.ПодъёмыНаБланкахЗаказа.Форма.ФормаЗаписи");//, Парам);
	//ФормаП.Запись.ВариантТаблицыПодъемов = Объект.Ссылка;
	
КонецПроцедуры
